stm32mpu-oem/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257CXX_VALIDX/stm32mp257cxx_validx.h
/**
  ******************************************************************************
  * @file    stm32mp257cxx_validx.h
  * @author  MCD Application Team
  * @brief   This file contains definitions for STM32MP257CXX_VALIDX:
  *          LEDs
  *          push-buttons
  *          COM ports
  *          hardware resources.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP257CXX_VALIDX
#define STM32MP257CXX_VALIDX

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp257cxx_validx_conf.h"
#include "stm32mp257cxx_validx_errno.h"
#include "stm32mp_util_conf.h"

#if (USE_BSP_COM_FEATURE > 0)
  #if (USE_COM_LOG > 0)
    #ifndef __GNUC__
      #include "stdio.h"
    #endif
  #endif
#endif

#if !defined (USE_BSP)
  #define USE_BSP
#endif

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32MP257CXX_VALIDX
  * @{
  */

/** @addtogroup STM32MP257CXX_VALIDX_LOW_LEVEL
  * @{
  */

/** @defgroup STM32MP257CXX_VALIDX_LOW_LEVEL_Exported_Types Exported Types
  * @{
  */
typedef enum
{
  LED1 = 0U,
  LED_RED = LED1,
  LED2 = 1U,
  LED_GREEN = LED2,
  LED3 = 2U,
  LED_ORANGE = LED3,
  LED4 = 3U,
  LED_BLUE = LED4,
  LEDn
} Led_TypeDef;

typedef enum
{
  BUTTON_WAKEUP = 0U,
  BUTTONn
} Button_TypeDef;

typedef enum
{
  BUTTON_MODE_GPIO = 0U,
  BUTTON_MODE_EXTI = 1U
} ButtonMode_TypeDef;

#if (USE_BSP_COM_FEATURE > 0)
typedef enum
{
  /* Define COM_VCP_CA35, COM_VCP_CM33, COM_CM0PLUS to match COM_USART[] table in stm32mp257cxx_validx.c
   * These values are to be used in examples
   */
  COM_VCP_CA35 = 0U,
  COM_VCP_CM33 = 1U,
  COM_CM0PLUS = 2U,
  /* Define COM1, COM2, COM3 aliases
   * These values are to be used in Validation applications
   * They allow to use same COM<n> whatever the used core
   * and avoid ifdefs in validation code
   */
#if defined(CORE_CA35)
  COM1 = COM_VCP_CA35,
  COM2 = COM_VCP_CM33,
  COM3 = COM_CM0PLUS,
#elif defined(CORE_CM33)
  COM1 = COM_VCP_CM33,
  COM2 = COM_VCP_CA35,
  COM3 = COM_CM0PLUS,
#elif defined(CORE_CM0PLUS)
  COM1 = COM_CM0PLUS,
  COM2 = COM_VCP_CA35,
  COM3 = COM_CM0PLUS,
#endif /* CORE_<...> */
  COMn
} COM_TypeDef;

typedef enum
{
  COM_STOPBITS_1     =   UART_STOPBITS_1,
  COM_STOPBITS_2     =   UART_STOPBITS_2,
} COM_StopBitsTypeDef;

typedef enum
{
  COM_PARITY_NONE     =  UART_PARITY_NONE,
  COM_PARITY_EVEN     =  UART_PARITY_EVEN,
  COM_PARITY_ODD      =  UART_PARITY_ODD,
}COM_ParityTypeDef;

typedef enum
{
  COM_HWCONTROL_NONE    =  UART_HWCONTROL_NONE,
  COM_HWCONTROL_RTS     =  UART_HWCONTROL_RTS,
  COM_HWCONTROL_CTS     =  UART_HWCONTROL_CTS,
  COM_HWCONTROL_RTS_CTS =  UART_HWCONTROL_RTS_CTS,
} COM_HwFlowCtlTypeDef;

typedef enum
{
  COM_WORDLENGTH_7B = UART_WORDLENGTH_7B,
  COM_WORDLENGTH_8B = UART_WORDLENGTH_8B,
  COM_WORDLENGTH_9B = UART_WORDLENGTH_9B,
} COM_WordLengthTypeDef;

typedef struct
{
  uint32_t              BaudRate;
  COM_WordLengthTypeDef WordLength;
  COM_StopBitsTypeDef   StopBits;
  COM_ParityTypeDef     Parity;
  COM_HwFlowCtlTypeDef  HwFlowCtl;
} COM_InitTypeDef;

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
typedef struct
{
  void (* pMspInitCb)(UART_HandleTypeDef *);
  void (* pMspDeInitCb)(UART_HandleTypeDef *);
} BSP_COM_Cb_t;
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
#endif /* USE_BSP_COM_FEATURE */

/**
  * @}
  */

/** @defgroup STM32MP257CXX_VALIDX_LOW_LEVEL_Exported_Constants Exported Constants
  * @{
  */
/**
  * @brief  Define for STM32MP257CXX VALIDX board
  */
#if !defined (USE_STM32MP257CXX_VALIDX)
#define USE_STM32MP257CXX_VALIDX
#endif
/**
  * @brief STM32MP257CXX VALIDX BSP Driver version number V3.5.1
  */
#define STM32MP257CXX_VALIDX_BSP_VERSION_MAIN   (0x00) /*!< [31:24] main version */
#define STM32MP257CXX_VALIDX_BSP_VERSION_SUB1   (0x01) /*!< [23:16] sub1 version */
#define STM32MP257CXX_VALIDX_BSP_VERSION_SUB2   (0x00) /*!< [15:8]  sub2 version */
#define STM32MP257CXX_VALIDX_BSP_VERSION_RC     (0x00) /*!< [7:0]  release candidate */
#define STM32MP257CXX_VALIDX_BSP_VERSION        ((STM32MP257CXX_VALIDX_BSP_VERSION_MAIN << 24)\
                                                |(STM32MP257CXX_VALIDX_BSP_VERSION_SUB1 << 16)\
                                                |(STM32MP257CXX_VALIDX_BSP_VERSION_SUB2 << 8 )\
                                                |(STM32MP257CXX_VALIDX_BSP_VERSION_RC))
#define STM32MP257CXX_VALIDX_BSP_BOARD_NAME  "STM32MP257CXX-VALIDX";
#define STM32MP257CXX_VALIDX_BSP_BOARD_ID    "MB170/4,5,6";

/** @defgroup STM32MP257CXX_VALIDX_LOW_LEVEL_LED EVAL LOW LEVEL LED
  * @{
  */
#if defined (CORE_CA35) || defined (CORE_CM33)
#define LED1_GPIO_PORT                   GPIOH
#define LED1_PIN                         GPIO_PIN_4
#define LED1_GPIO_CLK_ENABLE()           __HAL_RCC_GPIOH_CLK_ENABLE()
#define LED1_GPIO_CLK_DISABLE()          __HAL_RCC_GPIOH_CLK_DISABLE()

#if defined (USE_STM32MP257CXX_VALID1)  || defined(USE_STM32MP257CXX_VALID3)
#define LED2_GPIO_PORT                   GPIOJ
#define LED2_PIN                         GPIO_PIN_11
#define LED2_GPIO_CLK_ENABLE()           __HAL_RCC_GPIOJ_CLK_ENABLE()
#define LED2_GPIO_CLK_DISABLE()          __HAL_RCC_GPIOJ_CLK_DISABLE()

#define LED3_GPIO_PORT                   GPIOI
#define LED3_PIN                         GPIO_PIN_13
#define LED3_GPIO_CLK_ENABLE()           __HAL_RCC_GPIOI_CLK_ENABLE()
#define LED3_GPIO_CLK_DISABLE()          __HAL_RCC_GPIOI_CLK_DISABLE()

