stm32mpu-oem/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257CXX_VALIDX/stm32mp257cxx_validx.h
#define LED4_GPIO_PORT                   GPIOI
#define LED4_PIN                         GPIO_PIN_4
#define LED4_GPIO_CLK_ENABLE()           __HAL_RCC_GPIOI_CLK_ENABLE()
#define LED4_GPIO_CLK_DISABLE()          __HAL_RCC_GPIOI_CLK_DISABLE()

#elif defined(USE_STM32MP257CXX_VALID2)
#define LED2_GPIO_PORT                   GPIOJ
#define LED2_PIN                         GPIO_PIN_5
#define LED2_GPIO_CLK_ENABLE()           __HAL_RCC_GPIOJ_CLK_ENABLE()
#define LED2_GPIO_CLK_DISABLE()          __HAL_RCC_GPIOJ_CLK_DISABLE()

#define LED3_GPIO_PORT                   GPIOJ
#define LED3_PIN                         GPIO_PIN_1
#define LED3_GPIO_CLK_ENABLE()           __HAL_RCC_GPIOJ_CLK_ENABLE()
#define LED3_GPIO_CLK_DISABLE()          __HAL_RCC_GPIOJ_CLK_DISABLE()

#define LED4_GPIO_PORT                   GPIOJ
#define LED4_PIN                         GPIO_PIN_7
#define LED4_GPIO_CLK_ENABLE()           __HAL_RCC_GPIOJ_CLK_ENABLE()
#define LED4_GPIO_CLK_DISABLE()          __HAL_RCC_GPIOJ_CLK_DISABLE()

#elif defined (USE_STM32MP257CXX_UNIBOARD)
/* No dedicated LED on Uniboard */
#else
#error "Please define target board"
#endif /* USE_STM32MP257CXX_VALID1 */
#elif defined (CORE_CM0PLUS)

/* Core M0 can't manage LED in Validx Board */
#endif /* CORE_CA35 || CORE_CM33 */
/**
  * @}
  */

/** @defgroup STM32MP257CXX_VALIDX_LOW_LEVEL_BUTTON LOW LEVEL BUTTON
  * @{
  */
/* Button state */
#define BUTTON_RELEASED                    0U
#define BUTTON_PRESSED                     1U
/**
  * @brief Wakeup push-button
  */
#if defined (CORE_CA35) || defined (CORE_CM33)
#define BUTTON_WAKEUP_PIN                   GPIO_PIN_2
#define BUTTON_WAKEUP_GPIO_PORT             GPIOG
#define BUTTON_WAKEUP_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOG_CLK_ENABLE()
#define BUTTON_WAKEUP_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOG_CLK_DISABLE()
#define BUTTON_WAKEUP_EXTI_IRQn             EXTI2_2_IRQn
#define BUTTON_WAKEUP_EXTI_LINE             EXTI2_LINE_2
#endif
/**
  * @}
  */

/** @defgroup STM32MP257CXX_VALIDX_LOW_LEVEL_COM LOW LEVEL COM
  * @{
  */
#if (USE_BSP_COM_FEATURE > 0)
/**
  * @brief Definition for COM port1, connected to USART2
  */
#if defined (CORE_CA35) || defined (CORE_CM33)
#if defined(USE_STM32MP257CXX_UNIBOARD)
#define COM_COMMON_UART                   UART5 // VALID1/3
#if defined(COM_COMMON_NO_CLOCKING)
#define COM_COMMON_ENABLE()
#define COM_COMMON_DISABLE()
#else /* COM_COMMON_NO_CLOCKING */
#define COM_COMMON_CLK_ENABLE()             __HAL_RCC_UART5_CLK_ENABLE()
#define COM_COMMON_CLK_DISABLE()            __HAL_RCC_UART5_CLK_DISABLE()
#endif /* COM_COMMON_NO_CLOCKING */

#define COM_COMMON_TX_PIN                   GPIO_PIN_9
#define COM_COMMON_TX_GPIO_PORT             GPIOG
#if defined(COM_COMMON_NO_CLOCKING)
#define COM_COMMON_TX_GPIO_CLK_ENABLE()
#define COM_COMMON_TX_GPIO_CLK_DISABLE()
#else /* COM_COMMON_NO_CLOCKING */
#define COM_COMMON_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOG_CLK_ENABLE()
#define COM_COMMON_TX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOG_CLK_DISABLE()
#endif /* COM_VCP_CM33_NO_CLOCKING */
#define COM_COMMON_TX_AF                    GPIO_AF5_UART5

#define COM_COMMON_RX_PIN                   GPIO_PIN_10
#define COM_COMMON_RX_GPIO_PORT             GPIOG
#if defined(COM_COMMON_NO_CLOCKING)
#define COM_COMMON_RX_GPIO_CLK_ENABLE()
#define COM_COMMON_RX_GPIO_CLK_DISABLE()
#else /* COM_COMMON_NO_CLOCKING */
#define COM_COMMON_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOG_CLK_ENABLE()
#define COM_COMMON_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOG_CLK_DISABLE()
#endif /* COM_COMMON_NO_CLOCKING */
#define COM_COMMON_RX_AF                    GPIO_AF5_UART5
#else /* USE_STM32MP257CXX_UNIBOARD */

/*********************** COM_CA35 ******************************/
#if (UTIL_UART_INSTANCE == UTIL_USART1)
  #define COM_CA35_UART                       USART1
  #define COM_CA35_CLK_ENABLE()             __HAL_RCC_USART1_CLK_ENABLE()
  #define COM_CA35_CLK_DISABLE()            __HAL_RCC_USART1_CLK_DISABLE()
#elif (UTIL_UART_INSTANCE == UTIL_USART2)
  #define COM_CA35_UART                       USART2
  #define COM_CA35_CLK_ENABLE()             __HAL_RCC_USART2_CLK_ENABLE()
  #define COM_CA35_CLK_DISABLE()            __HAL_RCC_USART2_CLK_DISABLE()
#elif (UTIL_UART_INSTANCE == UTIL_USART3)
  #define COM_CA35_UART                       USART3
  #define COM_CA35_CLK_ENABLE()             __HAL_RCC_USART3_CLK_ENABLE()
  #define COM_CA35_CLK_DISABLE()            __HAL_RCC_USART3_CLK_DISABLE()
#elif (UTIL_UART_INSTANCE == UTIL_UART4)
  #define COM_CA35_UART                       UART4
  #define COM_CA35_CLK_ENABLE()             __HAL_RCC_UART4_CLK_ENABLE()
  #define COM_CA35_CLK_DISABLE()            __HAL_RCC_UART4_CLK_DISABLE()
#elif (UTIL_UART_INSTANCE == UTIL_UART5)
  #define COM_CA35_UART                       UART5
  #define COM_CA35_CLK_ENABLE()             __HAL_RCC_UART5_CLK_ENABLE()
  #define COM_CA35_CLK_DISABLE()            __HAL_RCC_UART5_CLK_DISABLE()
#elif (UTIL_UART_INSTANCE == UTIL_USART6)
  #define COM_CA35_UART                       USART6
  #define COM_CA35_CLK_ENABLE()             __HAL_RCC_USART6_CLK_ENABLE()
  #define COM_CA35_CLK_DISABLE()            __HAL_RCC_USART6_CLK_DISABLE()
#elif (UTIL_UART_INSTANCE == UTIL_UART7)
  #define COM_CA35_UART                       UART7
  #define COM_CA35_CLK_ENABLE()             __HAL_RCC_UART7_CLK_ENABLE()
  #define COM_CA35_CLK_DISABLE()            __HAL_RCC_UART7_CLK_DISABLE()
#elif (UTIL_UART_INSTANCE == UTIL_UART8)
  #define COM_CA35_UART                       UART8
  #define COM_CA35_CLK_ENABLE()             __HAL_RCC_UART8_CLK_ENABLE()
  #define COM_CA35_CLK_DISABLE()            __HAL_RCC_UART8_CLK_DISABLE()
#elif (UTIL_UART_INSTANCE == UTIL_UART9)
  #define COM_CA35_UART                       UART9
  #define COM_CA35_CLK_ENABLE()             __HAL_RCC_UART9_CLK_ENABLE()
  #define COM_CA35_CLK_DISABLE()            __HAL_RCC_UART9_CLK_DISABLE()
#elif (UTIL_UART_INSTANCE == UTIL_LPUART1)
  #define COM_CA35_UART                       LPUART1
  #define COM_CA35_CLK_ENABLE()             __HAL_RCC_LPUART1_CLK_ENABLE()
  #define COM_CA35_CLK_DISABLE()            __HAL_RCC_LPUART1_CLK_DISABLE()
#else
  #error "unknown UTIL_UART_INSTANCE definition."
#endif

