stm32mpu-oem/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257CXX_VALIDX/stm32mp257cxx_validx.h
#define COM_CA35_TX_PIN                     UTIL_UART_TX_PIN

#if (UTIL_UART_TX_GPIO_PORT == UTIL_GPIOA)
  #define COM_CA35_TX_GPIO_PORT             GPIOA
  #define COM_CA35_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOA_CLK_ENABLE()
  #define COM_CA35_TX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOA_CLK_DISABLE()
#elif (UTIL_UART_TX_GPIO_PORT == UTIL_GPIOB)
  #define COM_CA35_TX_GPIO_PORT             GPIOB
  #define COM_CA35_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOB_CLK_ENABLE()
  #define COM_CA35_TX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOB_CLK_DISABLE()
#elif (UTIL_UART_TX_GPIO_PORT == UTIL_GPIOC)
  #define COM_CA35_TX_GPIO_PORT             GPIOC
  #define COM_CA35_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOC_CLK_ENABLE()
  #define COM_CA35_TX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOC_CLK_DISABLE()
#elif (UTIL_UART_TX_GPIO_PORT == UTIL_GPIOD)
  #define COM_CA35_TX_GPIO_PORT             GPIOD
  #define COM_CA35_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOD_CLK_ENABLE()
  #define COM_CA35_TX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOD_CLK_DISABLE()
#elif (UTIL_UART_TX_GPIO_PORT == UTIL_GPIOE)
  #define COM_CA35_TX_GPIO_PORT             GPIOE
  #define COM_CA35_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOE_CLK_ENABLE()
  #define COM_CA35_TX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOE_CLK_DISABLE()
#elif (UTIL_UART_TX_GPIO_PORT == UTIL_GPIOF)
  #define COM_CA35_TX_GPIO_PORT             GPIOF
  #define COM_CA35_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOF_CLK_ENABLE()
  #define COM_CA35_TX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOF_CLK_DISABLE()
#elif (UTIL_UART_TX_GPIO_PORT == UTIL_GPIOG)
  #define COM_CA35_TX_GPIO_PORT             GPIOG
  #define COM_CA35_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOG_CLK_ENABLE()
  #define COM_CA35_TX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOG_CLK_DISABLE()
#elif (UTIL_UART_TX_GPIO_PORT == UTIL_GPIOH)
  #define COM_CA35_TX_GPIO_PORT             GPIOH
  #define COM_CA35_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOH_CLK_ENABLE()
  #define COM_CA35_TX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOH_CLK_DISABLE()
#elif (UTIL_UART_TX_GPIO_PORT == UTIL_GPIOI)
  #define COM_CA35_TX_GPIO_PORT             GPIOI
  #define COM_CA35_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOI_CLK_ENABLE()
  #define COM_CA35_TX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOI_CLK_DISABLE()
#elif (UTIL_UART_TX_GPIO_PORT == UTIL_GPIOJ)
  #define COM_CA35_TX_GPIO_PORT             GPIOJ
  #define COM_CA35_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOJ_CLK_ENABLE()
  #define COM_CA35_TX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOJ_CLK_DISABLE()
#elif (UTIL_UART_TX_GPIO_PORT == UTIL_GPIOK)
  #define COM_CA35_TX_GPIO_PORT             GPIOK
  #define COM_CA35_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOK_CLK_ENABLE()
  #define COM_CA35_TX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOK_CLK_DISABLE()
#elif (UTIL_UART_TX_GPIO_PORT == UTIL_GPIOZ)
  #define COM_CA35_TX_GPIO_PORT             GPIOZ
  #define COM_CA35_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOZ_CLK_ENABLE()
  #define COM_CA35_TX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOZ_CLK_DISABLE()
#else
  #error "unknown UTIL_UART_TX_GPIO_PORT definition."
#endif

#define COM_CA35_TX_AF                      UTIL_UART_TX_AF

#define COM_CA35_RX_PIN                     UTIL_UART_RX_PIN

#if (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOA)
  #define COM_CA35_RX_GPIO_PORT             GPIOA
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOA_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOA_CLK_DISABLE()
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOB)
  #define COM_CA35_RX_GPIO_PORT             GPIOB
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOB_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOB_CLK_DISABLE()
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOC)
  #define COM_CA35_RX_GPIO_PORT             GPIOC
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOC_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOC_CLK_DISABLE()
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOD)
  #define COM_CA35_RX_GPIO_PORT             GPIOD
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOD_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOD_CLK_DISABLE()
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOE)
  #define COM_CA35_RX_GPIO_PORT             GPIOE
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOE_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOE_CLK_DISABLE()
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOF)
  #define COM_CA35_RX_GPIO_PORT             GPIOF
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOF_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOF_CLK_DISABLE()
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOG)
  #define COM_CA35_RX_GPIO_PORT             GPIOG
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOG_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOG_CLK_DISABLE()
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOH)
  #define COM_CA35_RX_GPIO_PORT             GPIOH
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOH_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOH_CLK_DISABLE()
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOI)
  #define COM_CA35_RX_GPIO_PORT             GPIOI
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOI_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOI_CLK_DISABLE()
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOJ)
  #define COM_CA35_RX_GPIO_PORT             GPIOJ
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOJ_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOJ_CLK_DISABLE()
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOK)
  #define COM_CA35_RX_GPIO_PORT             GPIOK
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOK_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOK_CLK_DISABLE()
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOZ)
  #define COM_CA35_RX_GPIO_PORT             GPIOZ
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOZ_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOZ_CLK_DISABLE()
#else
  #error "unknown UTIL_UART_RX_GPIO_PORT definition."
#endif

#define COM_CA35_RX_AF                      UTIL_UART_RX_AF

/*********************** COM_CM33 ******************************/
#if defined(USE_STM32MP257CXX_VALID1) || defined(USE_STM32MP257CXX_VALID3)
#define COM_CM33_UART                       UART5 // VALID1/3
#if defined(COM_VCP_CM33_NO_CLOCKING)
#define COM_CM33_CLK_ENABLE()
#define COM_CM33_CLK_DISABLE()
#else /* COM_VCP_CM33_NO_CLOCKING */
#define COM_CM33_CLK_ENABLE()               __HAL_RCC_UART5_CLK_ENABLE()
#define COM_CM33_CLK_DISABLE()              __HAL_RCC_UART5_CLK_DISABLE()
#endif /* COM_VCP_CM33_NO_CLOCKING */

#define COM_CM33_TX_PIN                     GPIO_PIN_9
#define COM_CM33_TX_GPIO_PORT               GPIOG
#if defined(COM_VCP_CM33_NO_CLOCKING)
#define COM_CM33_TX_GPIO_CLK_ENABLE()
#define COM_CM33_TX_GPIO_CLK_DISABLE()
#else /* COM_VCP_CM33_NO_CLOCKING */
#define COM_CM33_TX_GPIO_CLK_ENABLE()       __HAL_RCC_GPIOG_CLK_ENABLE()
#define COM_CM33_TX_GPIO_CLK_DISABLE()      __HAL_RCC_GPIOG_CLK_DISABLE()
#endif /* COM_VCP_CM33_NO_CLOCKING */
#define COM_CM33_TX_AF                      GPIO_AF5_UART5

#define COM_CM33_RX_PIN                     GPIO_PIN_10
#define COM_CM33_RX_GPIO_PORT               GPIOG
#if defined(COM_VCP_CM33_NO_CLOCKING)
#define COM_CM33_RX_GPIO_CLK_ENABLE()
#define COM_CM33_RX_GPIO_CLK_DISABLE()
#else /* COM_VCP_CM33_NO_CLOCKING */
#define COM_CM33_RX_GPIO_CLK_ENABLE()       __HAL_RCC_GPIOG_CLK_ENABLE()
#define COM_CM33_RX_GPIO_CLK_DISABLE()      __HAL_RCC_GPIOG_CLK_DISABLE()
#endif /* COM_VCP_CM33_NO_CLOCKING */
#define COM_CM33_RX_AF                      GPIO_AF5_UART5

#elif defined(USE_STM32MP257CXX_VALID2)
#define COM_CM33_UART                       UART8 // VALID2
#if defined(COM_VCP_CM33_NO_CLOCKING)
#define COM_CM33_CLK_ENABLE()
#define COM_CM33_CLK_DISABLE()
#else /* COM_VCP_CM33_NO_CLOCKING */
#define COM_CM33_CLK_ENABLE()               __HAL_RCC_UART8_CLK_ENABLE()
#define COM_CM33_CLK_DISABLE()              __HAL_RCC_UART8_CLK_DISABLE()
#endif /* COM_VCP_CM33_NO_CLOCKING */

#define COM_CM33_TX_PIN                     GPIO_PIN_11
#define COM_CM33_TX_GPIO_PORT               GPIOI
#if defined(COM_VCP_CM33_NO_CLOCKING)
#define COM_CM33_TX_GPIO_CLK_ENABLE()
#define COM_CM33_TX_GPIO_CLK_DISABLE()
#else /* COM_VCP_CM33_NO_CLOCKING */
#define COM_CM33_TX_GPIO_CLK_ENABLE()       __HAL_RCC_GPIOI_CLK_ENABLE()
#define COM_CM33_TX_GPIO_CLK_DISABLE()      __HAL_RCC_GPIOI_CLK_DISABLE()
#endif /* COM_VCP_CM33_NO_CLOCKING */
#define COM_CM33_TX_AF                      GPIO_AF5_UART8

