stm32mpu-oem/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257CXX_VALIDX/stm32mp257cxx_validx.h
#define COM_CM33_RX_PIN                     GPIO_PIN_13
#define COM_CM33_RX_GPIO_PORT               GPIOB
#if defined(COM_VCP_CM33_NO_CLOCKING)
#define COM_CM33_RX_GPIO_CLK_ENABLE()
#define COM_CM33_RX_GPIO_CLK_DISABLE()
#else /* COM_VCP_CM33_NO_CLOCKING */
#define COM_CM33_RX_GPIO_CLK_ENABLE()       __HAL_RCC_GPIOB_CLK_ENABLE()
#define COM_CM33_RX_GPIO_CLK_DISABLE()      __HAL_RCC_GPIOB_CLK_DISABLE()
#endif /* COM_VCP_CM33_NO_CLOCKING */
#define COM_CM33_RX_AF                      GPIO_AF5_UART8
#else
#error "Please define target board"
#endif /* USE_STM32MP257CXX_VALID1 || USE_STM32MP257CXX_VALID3 */
#endif /* CORE_CA35 || CORE_CM33 */
#endif /* USE_STM32MP257CXX_UNIBOARD */

#if ! defined(USE_STM32MP257CXX_UNIBOARD)
#if defined (CORE_CM0PLUS) && ! defined(COM_CM0PLUS_NO_CLOCKING)
#define COM_CM0PLUS_NO_CLOCKING
#endif /* CORE_CM0PLUS && ! COM_CM0PLUS_NO_CLOCKING */

/*********************** COM_CM0PLUS ******************************/
#define COM_CM0PLUS_UART                    LPUART1 // VALID1/2/3
#if defined(COM_CM0PLUS_NO_CLOCKING)
#define COM_CM0PLUS_CLK_ENABLE()
#define COM_CM0PLUS_CLK_DISABLE()
#else /* COM_CM0PLUS_NO_CLOCKING */
#define COM_CM0PLUS_CLK_ENABLE()            __HAL_RCC_LPUART1_CLK_ENABLE()
#define COM_CM0PLUS_CLK_DISABLE()           __HAL_RCC_LPUART1_CLK_DISABLE()
#endif /* COM_CM0PLUS_NO_CLOCKING */

#define COM_CM0PLUS_TX_PIN                  GPIO_PIN_0
#define COM_CM0PLUS_TX_GPIO_PORT            GPIOZ
#if defined(COM_CM0PLUS_NO_CLOCKING)
#define COM_CM0PLUS_TX_GPIO_CLK_ENABLE()
#define COM_CM0PLUS_TX_GPIO_CLK_DISABLE()
#else /* COM_CM0PLUS_NO_CLOCKING */
#define COM_CM0PLUS_TX_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOZ_CLK_ENABLE()
#define COM_CM0PLUS_TX_GPIO_CLK_DISABLE()   __HAL_RCC_GPIOZ_CLK_DISABLE()
#endif /* COM_CM0PLUS_NO_CLOCKING */
#define COM_CM0PLUS_TX_AF                   GPIO_AF6_LPUART1

#define COM_CM0PLUS_RX_PIN                  GPIO_PIN_1
#define COM_CM0PLUS_RX_GPIO_PORT            GPIOZ
#if defined(COM_CM0PLUS_NO_CLOCKING)
#define COM_CM0PLUS_RX_GPIO_CLK_ENABLE()
#define COM_CM0PLUS_RX_GPIO_CLK_DISABLE()
#else /* COM_CM0PLUS_NO_CLOCKING */
#define COM_CM0PLUS_RX_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOZ_CLK_ENABLE()
#define COM_CM0PLUS_RX_GPIO_CLK_DISABLE()   __HAL_RCC_GPIOZ_CLK_DISABLE()
#endif /* COM_CM0PLUS_NO_CLOCKING */
#define COM_CM0PLUS_RX_AF                   GPIO_AF6_LPUART1
#endif /* ! USE_STM32MP257CXX_UNIBOARD */

#define COM_POLL_TIMEOUT              1000
#define COM1_RX_TIMEOUT               HAL_MAX_DELAY
#define MX_UART_InitTypeDef COM_InitTypeDef
#endif
/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup STM32MP257CXX_VALIDX_LOW_LEVEL_Exported_Variables
  * @{
  */
extern EXTI_HandleTypeDef hpb_exti[];
#if (USE_BSP_COM_FEATURE > 0)
extern UART_HandleTypeDef hcom_uart[];
extern USART_TypeDef* COM_USART[];
#endif

/**
  * @}
  */

/** @addtogroup STM32MP257CXX_VALIDX_LOW_LEVEL_Exported_Functions
  * @{
  */
int32_t BSP_GetVersion(void);
const uint8_t* BSP_GetBoardName(void);
const uint8_t* BSP_GetBoardID(void);

int32_t BSP_LED_Init(Led_TypeDef Led);
int32_t BSP_LED_DeInit(Led_TypeDef Led);
int32_t BSP_LED_On(Led_TypeDef Led);
int32_t BSP_LED_Off(Led_TypeDef Led);
int32_t BSP_LED_Toggle(Led_TypeDef Led);
int32_t BSP_LED_GetState (Led_TypeDef Led);
int32_t BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode);
int32_t BSP_PB_DeInit(Button_TypeDef Button);
int32_t BSP_PB_GetState(Button_TypeDef Button);
void    BSP_PB_Callback(Button_TypeDef Button);
#if (USE_BSP_COM_FEATURE > 0)
int32_t  BSP_COM_Init(COM_TypeDef COM, COM_InitTypeDef *COM_Init);
int32_t  BSP_COM_DeInit(COM_TypeDef COM);
#if (USE_COM_LOG > 0)
int32_t  BSP_COM_SelectLogPort (COM_TypeDef COM);
#endif

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
int32_t BSP_COM_RegisterDefaultMspCallbacks(COM_TypeDef COM);
int32_t BSP_COM_RegisterMspCallbacks(COM_TypeDef COM, BSP_COM_Cb_t *Callback);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
HAL_StatusTypeDef MX_USART_Init(UART_HandleTypeDef *huart, MX_UART_InitTypeDef *COM_Init);
#endif /* USE_BSP_COM_FEATURE */

void BSP_PB_IRQHandler(Button_TypeDef Button);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32257CXX_VALIDX */
